# Repositories for brew and cask
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"

# Language frameworks, library packages, CLI tools
# For openjdk, set LTS version and add symbolic link
#     sudo ln -sfn /usr/local/opt/openjdk@17/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.17.jdk
#     sudo ln -sfn /usr/local/opt/openjdk@21/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.21.jdk
# For postgresql, set stable version
# For python, set stable version
# For fzf, source the completions in ~/.zshrc
brew "agg"
brew "asciinema"
brew "boost"
brew "clang-format"
brew "cmake"
brew "dos2unix"
brew "etcd", restart_service: false
brew "exiftool"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "golangci-lint"
brew "goreleaser/tap/goreleaser"
brew "gotestsum"
brew "gradle"
brew "jq"
brew "kotlin"
brew "mockery"
brew "mysql", restart_service: false
brew "neovim"
brew "nmap"
brew "node"
brew "numpy"
brew "openjdk@17"
brew "openjdk@21"
brew "poetry"
brew "postgresql@16", restart_service: false
brew "protobuf"
brew "python@3.12"
brew "python@3.13"
brew "rust"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "staticcheck"
brew "virtualenv"
brew "yt-dlp"

# Casks applications
cask "dbeaver-community"
cask "discord"
cask "jetbrains-toolbox"
cask "postman"
cask "qmk-toolbox"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "wireshark"
